{"title":"Journey Template COPY OF SOLUTIONS TEMPLATE!","sections":"<div id=\"content\">\n<div class=\"sect1\">\n<h2 id=\"_you_have_the_following_problem_to_be_solved\">You have the following problem to be solved</h2>\n<div class=\"sectionbody\">\n<div class=\"paragraph\">\n<p><em>Explain the problem your solution solves. In specific try to be precise on the root cause of the problem to provide a convincing solution. For example a problem \"We would need monitoring for our microservices application\" is quite inspecific. Nonetheless, make it much more concrete you could address the problem domain of the applier of the pattern more easily if saying. \"We need to be able to analyze at any time of timeframe in the past the process statistics of each of the containers running in a microservices application environment setup with Istio to be able to analyze resource leaks, system breaks, and resource consumption of the entire system.\"</em></p>\n</div>\n<div class=\"sect2\">\n<h3 id=\"_the_proposed_solution_enables_the_customer\">The proposed solution enables the customer</h3>\n<div class=\"paragraph\">\n<p><em>Explain the business value to the customer, i.e. \"would enable the customer to continously monitor the system resources and potentially even attach alerting on top of it for escalating critical system states eventually increasing system availability</em></p>\n</div>\n</div>\n<div class=\"sect2\">\n<h3 id=\"_the_proposed_solution_is\">The proposed solution is</h3>\n<div class=\"paragraph\">\n<p>Hi There from journey title 3.</p>\n</div>\n<div class=\"sect3\">\n<h4 id=\"_addressing_your_business\">addressing your business</h4>\n<div class=\"paragraph\">\n<p>_The business context, potentially also the application domain, i.e. \"Most valuable in the commence domain as it clearly focuses on regluartory context of that domain when it comes to data monitoring\"</p>\n</div>\n</div>\n<div class=\"sect3\">\n<h4 id=\"_addressing_your_architecture\">addressing your architecture</h4>\n<div class=\"paragraph\">\n<p><em>Explain the context the solution could be applied, i.e.</em></p>\n</div>\n<div class=\"ulist\">\n<ul>\n<li>\n<p><em>Kubernetes needs to host all applications to be monitored</em></p>\n</li>\n<li>\n<p><em>AWS needs to host all applications to be monitored in EKS</em></p>\n</li>\n<li>\n<p><em>Istio needs to orchestrate all applications to be monitored</em></p>\n</li>\n</ul>\n</div>\n</div>\n<div class=\"sect3\">\n<h4 id=\"_definitively_needed_if\">definitively needed if</h4>\n<div class=\"paragraph\">\n<p><em>Explain forces. Forces allow to rethinking the pattern writer <strong>\"What are the demands fostering this solution?\"</strong> / <strong>\"Why should I consider this solution?\"</strong>.</em></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div class=\"paragraph nav-footer\">\n<p></p>\n</div>\n</div>"}